analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/sdhc_regs.h
#define MXC_F_SDHC_HOST_CN_1_DATA_TRANSFER_WIDTH_POS   1 /**< HOST_CN_1_DATA_TRANSFER_WIDTH Position */
#define MXC_F_SDHC_HOST_CN_1_DATA_TRANSFER_WIDTH       ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_DATA_TRANSFER_WIDTH_POS)) /**< HOST_CN_1_DATA_TRANSFER_WIDTH Mask */

#define MXC_F_SDHC_HOST_CN_1_HS_EN_POS                 2 /**< HOST_CN_1_HS_EN Position */
#define MXC_F_SDHC_HOST_CN_1_HS_EN                     ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_HS_EN_POS)) /**< HOST_CN_1_HS_EN Mask */

#define MXC_F_SDHC_HOST_CN_1_DMA_SELECT_POS            3 /**< HOST_CN_1_DMA_SELECT Position */
#define MXC_F_SDHC_HOST_CN_1_DMA_SELECT                ((uint8_t)(0x3UL << MXC_F_SDHC_HOST_CN_1_DMA_SELECT_POS)) /**< HOST_CN_1_DMA_SELECT Mask */

#define MXC_F_SDHC_HOST_CN_1_EXT_DATA_TRANSFER_WIDTH_POS 5 /**< HOST_CN_1_EXT_DATA_TRANSFER_WIDTH Position */
#define MXC_F_SDHC_HOST_CN_1_EXT_DATA_TRANSFER_WIDTH   ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_EXT_DATA_TRANSFER_WIDTH_POS)) /**< HOST_CN_1_EXT_DATA_TRANSFER_WIDTH Mask */

#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_TEST_POS      6 /**< HOST_CN_1_CARD_DETECT_TEST Position */
#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_TEST          ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_CARD_DETECT_TEST_POS)) /**< HOST_CN_1_CARD_DETECT_TEST Mask */

#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_SIGNAL_POS    7 /**< HOST_CN_1_CARD_DETECT_SIGNAL Position */
#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_SIGNAL        ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_CARD_DETECT_SIGNAL_POS)) /**< HOST_CN_1_CARD_DETECT_SIGNAL Mask */

/**@} end of group SDHC_HOST_CN_1_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PWR SDHC_PWR
 * @brief    Power Control.
 * @{
 */
#define MXC_F_SDHC_PWR_BUS_POWER_POS                   0 /**< PWR_BUS_POWER Position */
#define MXC_F_SDHC_PWR_BUS_POWER                       ((uint8_t)(0x1UL << MXC_F_SDHC_PWR_BUS_POWER_POS)) /**< PWR_BUS_POWER Mask */

#define MXC_F_SDHC_PWR_BUS_VOLT_SEL_POS                1 /**< PWR_BUS_VOLT_SEL Position */
#define MXC_F_SDHC_PWR_BUS_VOLT_SEL                    ((uint8_t)(0x7UL << MXC_F_SDHC_PWR_BUS_VOLT_SEL_POS)) /**< PWR_BUS_VOLT_SEL Mask */

/**@} end of group SDHC_PWR_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_BLK_GAP SDHC_BLK_GAP
 * @brief    Block Gap Control.
 * @{
 */
#define MXC_F_SDHC_BLK_GAP_STOP_POS                    0 /**< BLK_GAP_STOP Position */
#define MXC_F_SDHC_BLK_GAP_STOP                        ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_STOP_POS)) /**< BLK_GAP_STOP Mask */

#define MXC_F_SDHC_BLK_GAP_CONT_POS                    1 /**< BLK_GAP_CONT Position */
#define MXC_F_SDHC_BLK_GAP_CONT                        ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_CONT_POS)) /**< BLK_GAP_CONT Mask */

#define MXC_F_SDHC_BLK_GAP_READ_WAIT_POS               2 /**< BLK_GAP_READ_WAIT Position */
#define MXC_F_SDHC_BLK_GAP_READ_WAIT                   ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_READ_WAIT_POS)) /**< BLK_GAP_READ_WAIT Mask */

#define MXC_F_SDHC_BLK_GAP_INTR_POS                    3 /**< BLK_GAP_INTR Position */
#define MXC_F_SDHC_BLK_GAP_INTR                        ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_INTR_POS)) /**< BLK_GAP_INTR Mask */

/**@} end of group SDHC_BLK_GAP_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_WAKEUP SDHC_WAKEUP
 * @brief    Wakeup Control.
 * @{
 */
#define MXC_F_SDHC_WAKEUP_CARD_INT_POS                 0 /**< WAKEUP_CARD_INT Position */
#define MXC_F_SDHC_WAKEUP_CARD_INT                     ((uint8_t)(0x1UL << MXC_F_SDHC_WAKEUP_CARD_INT_POS)) /**< WAKEUP_CARD_INT Mask */

#define MXC_F_SDHC_WAKEUP_CARD_INS_POS                 1 /**< WAKEUP_CARD_INS Position */
#define MXC_F_SDHC_WAKEUP_CARD_INS                     ((uint8_t)(0x1UL << MXC_F_SDHC_WAKEUP_CARD_INS_POS)) /**< WAKEUP_CARD_INS Mask */

#define MXC_F_SDHC_WAKEUP_CARD_REM_POS                 2 /**< WAKEUP_CARD_REM Position */
#define MXC_F_SDHC_WAKEUP_CARD_REM                     ((uint8_t)(0x1UL << MXC_F_SDHC_WAKEUP_CARD_REM_POS)) /**< WAKEUP_CARD_REM Mask */

/**@} end of group SDHC_WAKEUP_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_CLK_CN SDHC_CLK_CN
 * @brief    Clock Control.
 * @{
 */
#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_EN_POS          0 /**< CLK_CN_INTERNAL_CLK_EN Position */
#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_EN              ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_INTERNAL_CLK_EN_POS)) /**< CLK_CN_INTERNAL_CLK_EN Mask */

#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_STABLE_POS      1 /**< CLK_CN_INTERNAL_CLK_STABLE Position */
#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_STABLE          ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_INTERNAL_CLK_STABLE_POS)) /**< CLK_CN_INTERNAL_CLK_STABLE Mask */

#define MXC_F_SDHC_CLK_CN_SD_CLK_EN_POS                2 /**< CLK_CN_SD_CLK_EN Position */
#define MXC_F_SDHC_CLK_CN_SD_CLK_EN                    ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_SD_CLK_EN_POS)) /**< CLK_CN_SD_CLK_EN Mask */

#define MXC_F_SDHC_CLK_CN_CLK_GEN_SEL_POS              5 /**< CLK_CN_CLK_GEN_SEL Position */
#define MXC_F_SDHC_CLK_CN_CLK_GEN_SEL                  ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_CLK_GEN_SEL_POS)) /**< CLK_CN_CLK_GEN_SEL Mask */

#define MXC_F_SDHC_CLK_CN_UPPER_SDCLK_FREQ_SEL_POS     6 /**< CLK_CN_UPPER_SDCLK_FREQ_SEL Position */
#define MXC_F_SDHC_CLK_CN_UPPER_SDCLK_FREQ_SEL         ((uint16_t)(0x3UL << MXC_F_SDHC_CLK_CN_UPPER_SDCLK_FREQ_SEL_POS)) /**< CLK_CN_UPPER_SDCLK_FREQ_SEL Mask */

#define MXC_F_SDHC_CLK_CN_SDCLK_FREQ_SEL_POS           8 /**< CLK_CN_SDCLK_FREQ_SEL Position */
#define MXC_F_SDHC_CLK_CN_SDCLK_FREQ_SEL               ((uint16_t)(0xFFUL << MXC_F_SDHC_CLK_CN_SDCLK_FREQ_SEL_POS)) /**< CLK_CN_SDCLK_FREQ_SEL Mask */

/**@} end of group SDHC_CLK_CN_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_TO SDHC_TO
 * @brief    Timeout Control.
 * @{
 */
#define MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS             0 /**< TO_DATA_COUNT_VALUE Position */
#define MXC_F_SDHC_TO_DATA_COUNT_VALUE                 ((uint8_t)(0x7UL << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS)) /**< TO_DATA_COUNT_VALUE Mask */

