analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/sdhc_regs.h
#define MXC_F_SDHC_CFG_0_V3_0_POS                      25 /**< CFG_0_V3_0 Position */
#define MXC_F_SDHC_CFG_0_V3_0                          ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_V3_0_POS)) /**< CFG_0_V3_0 Mask */

#define MXC_F_SDHC_CFG_0_V1_8_POS                      26 /**< CFG_0_V1_8 Position */
#define MXC_F_SDHC_CFG_0_V1_8                          ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_V1_8_POS)) /**< CFG_0_V1_8 Mask */

#define MXC_F_SDHC_CFG_0_BIT_64_SYS_BUS_POS            28 /**< CFG_0_BIT_64_SYS_BUS Position */
#define MXC_F_SDHC_CFG_0_BIT_64_SYS_BUS                ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_BIT_64_SYS_BUS_POS)) /**< CFG_0_BIT_64_SYS_BUS Mask */

#define MXC_F_SDHC_CFG_0_ASYNC_INT_POS                 29 /**< CFG_0_ASYNC_INT Position */
#define MXC_F_SDHC_CFG_0_ASYNC_INT                     ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_ASYNC_INT_POS)) /**< CFG_0_ASYNC_INT Mask */

#define MXC_F_SDHC_CFG_0_SLOT_TYPE_POS                 30 /**< CFG_0_SLOT_TYPE Position */
#define MXC_F_SDHC_CFG_0_SLOT_TYPE                     ((uint32_t)(0x3UL << MXC_F_SDHC_CFG_0_SLOT_TYPE_POS)) /**< CFG_0_SLOT_TYPE Mask */

/**@} end of group SDHC_CFG_0_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_CFG_1 SDHC_CFG_1
 * @brief    Capabilities 32-63.
 * @{
 */
#define MXC_F_SDHC_CFG_1_SDR50_POS                     0 /**< CFG_1_SDR50 Position */
#define MXC_F_SDHC_CFG_1_SDR50                         ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_SDR50_POS)) /**< CFG_1_SDR50 Mask */

#define MXC_F_SDHC_CFG_1_SDR104_POS                    1 /**< CFG_1_SDR104 Position */
#define MXC_F_SDHC_CFG_1_SDR104                        ((uint32_t)(0x0UL << MXC_F_SDHC_CFG_1_SDR104_POS)) /**< CFG_1_SDR104 Mask */

#define MXC_F_SDHC_CFG_1_DDR50_POS                     2 /**< CFG_1_DDR50 Position */
#define MXC_F_SDHC_CFG_1_DDR50                         ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DDR50_POS)) /**< CFG_1_DDR50 Mask */

#define MXC_F_SDHC_CFG_1_DRIVER_A_POS                  4 /**< CFG_1_DRIVER_A Position */
#define MXC_F_SDHC_CFG_1_DRIVER_A                      ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DRIVER_A_POS)) /**< CFG_1_DRIVER_A Mask */

#define MXC_F_SDHC_CFG_1_DRIVER_C_POS                  5 /**< CFG_1_DRIVER_C Position */
#define MXC_F_SDHC_CFG_1_DRIVER_C                      ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DRIVER_C_POS)) /**< CFG_1_DRIVER_C Mask */

#define MXC_F_SDHC_CFG_1_DRIVER_D_POS                  6 /**< CFG_1_DRIVER_D Position */
#define MXC_F_SDHC_CFG_1_DRIVER_D                      ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DRIVER_D_POS)) /**< CFG_1_DRIVER_D Mask */

#define MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS          8 /**< CFG_1_TIMER_CNT_TUNING Position */
#define MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING              ((uint32_t)(0xFUL << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS)) /**< CFG_1_TIMER_CNT_TUNING Mask */

#define MXC_F_SDHC_CFG_1_TUNING_SDR50_POS              13 /**< CFG_1_TUNING_SDR50 Position */
#define MXC_F_SDHC_CFG_1_TUNING_SDR50                  ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_TUNING_SDR50_POS)) /**< CFG_1_TUNING_SDR50 Mask */

#define MXC_F_SDHC_CFG_1_RETUNING_POS                  14 /**< CFG_1_RETUNING Position */
#define MXC_F_SDHC_CFG_1_RETUNING                      ((uint32_t)(0x3UL << MXC_F_SDHC_CFG_1_RETUNING_POS)) /**< CFG_1_RETUNING Mask */

#define MXC_F_SDHC_CFG_1_CLK_MULTI_POS                 16 /**< CFG_1_CLK_MULTI Position */
#define MXC_F_SDHC_CFG_1_CLK_MULTI                     ((uint32_t)(0xFFUL << MXC_F_SDHC_CFG_1_CLK_MULTI_POS)) /**< CFG_1_CLK_MULTI Mask */

/**@} end of group SDHC_CFG_1_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_MAX_CURR_CFG SDHC_MAX_CURR_CFG
 * @brief    Maximum Current Capabilities.
 * @{
 */
#define MXC_F_SDHC_MAX_CURR_CFG_V3_3_POS               0 /**< MAX_CURR_CFG_V3_3 Position */
#define MXC_F_SDHC_MAX_CURR_CFG_V3_3                   ((uint32_t)(0xFFUL << MXC_F_SDHC_MAX_CURR_CFG_V3_3_POS)) /**< MAX_CURR_CFG_V3_3 Mask */

#define MXC_F_SDHC_MAX_CURR_CFG_V3_0_POS               8 /**< MAX_CURR_CFG_V3_0 Position */
#define MXC_F_SDHC_MAX_CURR_CFG_V3_0                   ((uint32_t)(0xFFUL << MXC_F_SDHC_MAX_CURR_CFG_V3_0_POS)) /**< MAX_CURR_CFG_V3_0 Mask */

#define MXC_F_SDHC_MAX_CURR_CFG_V1_8_POS               16 /**< MAX_CURR_CFG_V1_8 Position */
#define MXC_F_SDHC_MAX_CURR_CFG_V1_8                   ((uint32_t)(0xFFUL << MXC_F_SDHC_MAX_CURR_CFG_V1_8_POS)) /**< MAX_CURR_CFG_V1_8 Mask */

/**@} end of group SDHC_MAX_CURR_CFG_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_FORCE_CMD SDHC_FORCE_CMD
 * @brief    Force Event for Auto CMD Error Status.
 * @{
 */
#define MXC_F_SDHC_FORCE_CMD_NOT_EXCU_POS              0 /**< FORCE_CMD_NOT_EXCU Position */
#define MXC_F_SDHC_FORCE_CMD_NOT_EXCU                  ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_NOT_EXCU_POS)) /**< FORCE_CMD_NOT_EXCU Mask */

#define MXC_F_SDHC_FORCE_CMD_TO_POS                    1 /**< FORCE_CMD_TO Position */
#define MXC_F_SDHC_FORCE_CMD_TO                        ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_TO_POS)) /**< FORCE_CMD_TO Mask */

#define MXC_F_SDHC_FORCE_CMD_CRC_POS                   2 /**< FORCE_CMD_CRC Position */
#define MXC_F_SDHC_FORCE_CMD_CRC                       ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_CRC_POS)) /**< FORCE_CMD_CRC Mask */

#define MXC_F_SDHC_FORCE_CMD_END_BIT_POS               3 /**< FORCE_CMD_END_BIT Position */
#define MXC_F_SDHC_FORCE_CMD_END_BIT                   ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_END_BIT_POS)) /**< FORCE_CMD_END_BIT Mask */

#define MXC_F_SDHC_FORCE_CMD_INDEX_POS                 4 /**< FORCE_CMD_INDEX Position */
#define MXC_F_SDHC_FORCE_CMD_INDEX                     ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_INDEX_POS)) /**< FORCE_CMD_INDEX Mask */

#define MXC_F_SDHC_FORCE_CMD_NOT_ISSUED_POS            7 /**< FORCE_CMD_NOT_ISSUED Position */
#define MXC_F_SDHC_FORCE_CMD_NOT_ISSUED                ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_NOT_ISSUED_POS)) /**< FORCE_CMD_NOT_ISSUED Mask */

/**@} end of group SDHC_FORCE_CMD_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_FORCE_EVENT_INT_STAT SDHC_FORCE_EVENT_INT_STAT
 * @brief    Force Event for Error Interrupt Status.
 * @{
 */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_TO_POS     0 /**< FORCE_EVENT_INT_STAT_CMD_TO Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_TO         ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_TO_POS)) /**< FORCE_EVENT_INT_STAT_CMD_TO Mask */

